ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.h
/***************************************************************************//**
* \file cy_ble_gap.h
* \version 2.0
*
* \brief
*  Contains the prototypes and constants used in the BLE GAP profile.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#ifndef CY_BLE_GAP_H
#define CY_BLE_GAP_H

#include "cy_ble.h"


/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */


/***************************************
* Type Definitions
***************************************/

#if (CY_BLE_MODE_PROFILE)

/***************************************
* Enumerated Types and Structures
***************************************/

/**
 * \addtogroup group_ble_common_api_gap_definitions
 * @{
 */

/** New Event handler state machine type */
typedef enum
{
    CY_BLE_STATE_STOPPED,                             /**< BLE is turned off */
    CY_BLE_STATE_INITIALIZING,                        /**< Initializing state */
    CY_BLE_STATE_ON,                                  /**< BLE is turned on */
#if (CY_BLE_GAP_ROLE_CENTRAL)
    CY_BLE_STATE_CONNECTING,                          /**< Connecting */
#endif /* CY_BLE_GAP_ROLE_CENTRAL */
} cy_en_ble_state_t;


/** Scanning state machine type */
typedef enum
{
    CY_BLE_SCAN_STATE_STOPPED,                        /**< Scanning is stopped */
    CY_BLE_SCAN_STATE_SCAN_INITIATED,                 /**< Scanning is initiated */
    CY_BLE_SCAN_STATE_SCANNING,                       /**< Scanning process */
    CY_BLE_SCAN_STATE_STOP_INITIATED                  /**< Stop scanning is initiated */
} cy_en_ble_scan_state_t;

/** Advertising state machine type */
typedef enum
{
    CY_BLE_ADV_STATE_STOPPED,                         /**< Advertising is stopped */
    CY_BLE_ADV_STATE_ADV_INITIATED,                   /**< Advertising is initiated */
    CY_BLE_ADV_STATE_ADVERTISING,                     /**< Advertising process */
    CY_BLE_ADV_STATE_STOP_INITIATED                   /**< Stop advertising is initiated */
} cy_en_ble_adv_state_t;

/** Connection state machine type */
typedef enum
{
    CY_BLE_CONN_STATE_DISCONNECTED,                   /**< Essentially idle state */
    CY_BLE_CONN_STATE_CLIENT_DISCONNECTED_DISCOVERED, /**< Server is disconnected but discovered */
    CY_BLE_CONN_STATE_CONNECTED,                      /**< Peer device is connected for this and following states */
    CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING,        /**< Server services are being discovered */
    CY_BLE_CONN_STATE_CLIENT_INCL_DISCOVERING,        /**< Server included services are being discovered */
    CY_BLE_CONN_STATE_CLIENT_CHAR_DISCOVERING,        /**< Server characteristics are being discovered */
    CY_BLE_CONN_STATE_CLIENT_DESCR_DISCOVERING,       /**< Server char. descriptors are being discovered */
    CY_BLE_CONN_STATE_CLIENT_DISCOVERED               /**< Server is discovered */
} cy_en_ble_conn_state_t;


/** Structure with Generic Access Profile Service (GAPS) attribute handles */
typedef struct
{
    /** Service handle*/
    cy_ble_gatt_db_attr_handle_t serviceHandle;

    /** Handle of the GAPS Device Name Characteristic */
    cy_ble_gatt_db_attr_handle_t deviceNameCharHandle;

    /** Handle of the GAPS Appearance Characteristic */
    cy_ble_gatt_db_attr_handle_t appearanceCharHandle;

    /** Handle of the GAPS Peripheral Preferred Connection Parameters Characteristic */
    cy_ble_gatt_db_attr_handle_t prefConnParamCharHandle;

    /** Handle of the GAPS Central Address Resolution characteristic */
    cy_ble_gatt_db_attr_handle_t centralAddrResolutionCharHandle;

    /** Handle of the GAPS Resolvable Private Address Only characteristic */
    cy_ble_gatt_db_attr_handle_t resolvablePrivateAddressOnly;
} cy_stc_ble_gaps_t;


/** GAP Service characteristics server's GATT DB handles structure type */
typedef struct
{
    /** Handle of the GAPS Device Name Characteristic */
    cy_ble_gatt_db_attr_handle_t deviceNameCharHandle;

    /** Handle of the GAPS Appearance Characteristic */
    cy_ble_gatt_db_attr_handle_t appearanceCharHandle;

    /** Handle of the GAPS Peripheral Privacy Flag Parameters Characteristic */
    cy_ble_gatt_db_attr_handle_t periphPrivacyCharHandle;

    /** Handle of the GAPS Reconnection Address Characteristic */
    cy_ble_gatt_db_attr_handle_t reconnAddrCharHandle;

    /** Handle of the GAPS Peripheral Preferred Connection Parameters Characteristic */
    cy_ble_gatt_db_attr_handle_t prefConnParamCharHandle;

    /** Handle of the GAPS Central Address Resolution characteristic */
    cy_ble_gatt_db_attr_handle_t centralAddrResolutionCharHandle;

    /** Handle of the GAPS Resolvable Private Address Only characteristic */
    cy_ble_gatt_db_attr_handle_t resolvablePrivateAddressOnly;
}cy_stc_ble_gapc_t;

/* Stack mode defines */


/** Advertisement SIG assigned numbers */
typedef enum
{
    /** Flags */
    CY_BLE_GAP_ADV_FLAGS = 0x01u,

    /** Incomplete List of 16-bit Service Class UUIDs */
    CY_BLE_GAP_ADV_INCOMPL_16UUID,

    /** Complete List of 16-bit Service Class UUIDs */
    CY_BLE_GAP_ADV_COMPL_16UUID,

    /** Incomplete List of 32-bit Service Class UUIDs */
    CY_BLE_GAP_ADV_INCOMPL_32_UUID,

    /** Complete List of 32-bit Service Class UUIDs */
    CY_BLE_GAP_ADV_COMPL_32_UUID,

    /** Incomplete List of 128-bit Service Class UUIDs */
    CY_BLE_GAP_ADV_INCOMPL_128_UUID,

    /** Complete List of 128-bit Service Class UUIDs */
    CY_BLE_GAP_ADV_COMPL_128_UUID,

    /** Shortened Local Name */
    CY_BLE_GAP_ADV_SHORT_NAME,

    /** Complete Local Name */
    CY_BLE_GAP_ADV_COMPL_NAME,

