ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.h
    /** Tx Power Level */
    CY_BLE_GAP_ADV_TX_PWR_LVL,

    /** Class of Device */
    CY_BLE_GAP_ADV_CLASS_OF_DEVICE = 0x0Du,

    /** Simple Pairing Hash C */
    CY_BLE_GAP_ADV_SMPL_PAIR_HASH_C,

    /** Simple Pairing Randomizer R */
    CY_BLE_GAP_ADV_SMPL_PAIR_RANDOM_R,

    /** Device ID*/
    CY_BLE_GAP_ADV_DEVICE_ID,

    /** Security Manager TK Value */
    CY_BLE_GAP_ADV_SCRT_MNGR_TK_VAL = 0x10u,

    /** Security Manager Out of Band Flags */
    CY_BLE_GAP_ADV_SCRT_MNGR_OOB_FLAGS,

    /** Slave Connection Interval Range */
    CY_BLE_GAP_ADV_SLAVE_CONN_INTRV_RANGE,

    /** List of 16-bit Service Solicitation UUIDs */
    CY_BLE_GAP_ADV_SOLICIT_16UUID = 0x14u,

    /** List of 128-bit Service Solicitation UUIDs */
    CY_BLE_GAP_ADV_SOLICIT_128UUID,

    /** Service Data - 16-bit UUID */
    CY_BLE_GAP_ADV_SRVC_DATA_16UUID,

    /** Public Target Address */
    CY_BLE_GAP_ADV_PUBLIC_TARGET_ADDR,

    /** Random Target Address */
    CY_BLE_GAP_ADV_RANDOM_TARGET_ADDR,

    /** Appearance */
    CY_BLE_GAP_ADV_APPEARANCE,

    /** Advertising Interval */
    CY_BLE_GAP_ADV_ADVERT_INTERVAL,

    /** LE Bluetooth Device Address */
    CY_BLE_GAP_ADV_LE_BT_DEVICE_ADDR,

    /** LE Role */
    CY_BLE_GAP_ADV_LE_ROLE,

    /** Simple Pairing Hash C-256 */
    CY_BLE_GAP_ADV_SMPL_PAIR_HASH_C256,

    /** Simple Pairing Randomizer R-256 */
    CY_BLE_GAP_ADV_SMPL_PAIR_RANDOM_R256,

    /** List of 32-bit Service Solicitation UUIDs */
    CY_BLE_GAP_ADV_SOLICIT_32UUID,

    /** Service Data - 32-bit UUID */
    CY_BLE_GAP_ADV_SRVC_DATA_32UUID,

    /** Service Data - 128-bit UUID */
    CY_BLE_GAP_ADV_SRVC_DATA_128UUID,

    /** 3D Information Data */
    CY_BLE_GAP_ADV_3D_INFO_DATA = 0x3D,

    /** Manufacturer Specific Data */
    CY_BLE_GAP_ADV_MANUFACTURER_SPECIFIC_DATA = 0xFF
}cy_en_ble_gap_adv_assign_numbers_t;

/** GAPP advertising configuration parameters structure */
typedef struct
{
    /** The minimum interval for fast advertising the data and establishing the LE Connection */
    uint16_t fastAdvIntervalMin;

    /** The maximum interval for fast advertising the data and establishing the LE Connection */
    uint16_t fastAdvIntervalMax;

    /** The timeout value of  fast advertising with fast advertising interval parameters */
    uint16_t fastAdvTimeOut;

    /** Slow advertising enable */
    uint8_t  slowAdvEnable;

    /** The minimum interval for slow advertising the data and establishing the LE Connection */
    uint16_t slowAdvIntervalMin;

    /** The maximum interval for slow  advertising the data and establishing the LE Connection */
    uint16_t slowAdvIntervalMax;

    /** The timeout value of slow advertising with slow advertising interval parameters */
    uint16_t slowAdvTimeOut;
}cy_stc_ble_gapp_adv_params_t;

/** GAPC advertising configuration parameters structure */
typedef struct
{
    /** The scan interval when operating in Fast connection */
    uint16_t fastScanInterval;

    /** Defines the scan window when operating in Fast connection */
    uint16_t fastScanWindow;

    /** The timeout value of scanning with fast scan parameters */
    uint16_t fastScanTimeOut;

    /** Slow scan enable/disable */
    uint8_t  slowScanEnabled;

    /** The scan interval when operating in Slow connection */
    uint16_t slowScanInterval;

    /** Defines the scan window when operating in Slow connection */
    uint16_t slowScanWindow;

    /** The timeout value of scanning with Slow scan parameters */
    uint16_t slowScanTimeOut;

    /** The minimum permissible connection time value to be used during a connection event */
    uint16_t gapcConnectionIntervalMin;

    /** The maximum permissible connection time value to be used during a connection event */
    uint16_t gapcConnectionIntervalMax;

    /** Defines the maximum time between two received Data Packet PDUs before
     *  the connection is considered lost */
    uint16_t gapcConnectionSlaveLatency;

    /** Defines the LE link supervision timeout interval */
    uint16_t gapcConnectionTimeOut;
}cy_stc_ble_gapc_scan_params_t;

/** Store BLE Application Data parameter into flash */
typedef struct
{
    /** Source buffer*/
    const uint8_t *srcBuff;

    /** Destination buffer */
    const uint8_t *destAddr;

    /** Source buffer length */
    uint32_t      buffLen;
    
    /** Write mode: blocking (default) / non-blocking */
    uint32_t      writeMode;
    
} cy_stc_ble_app_flash_param_t;


/** @} group_ble_common_api_gap_definitions */
 
/***************************************
* API Constants
***************************************/


#define CY_BLE_AD_TYPE_MORE16UUID                  (0x02u)
#define CY_BLE_AD_TYPE_CMPL16UUID                  (0x03u)
#define CY_BLE_AD_TYPE_MORE32UUID                  (0x04u)
#define CY_BLE_AD_TYPE_CMPL32UUID                  (0x05u)
#define CY_BLE_AD_TYPE_MORE128UUID                 (0x06u)
#define CY_BLE_AD_TYPE_CMPL128UUID                 (0x07u)

#define CY_BLE_AD_TYPE_SERVICE_DATA                (0x16u)
#define CY_BLE_AD_SERVICE_DATA_OVERHEAD            (0x03u)

#define CY_BLE_DISCOVERY_IDLE                      (0x00u)
#define CY_BLE_DISCOVERY_SERVICE                   (0x01u)
#define CY_BLE_DISCOVERY_CHAR                      (0x02u)
#define CY_BLE_DISCOVERY_DESCR                     (0x03u)
#define CY_BLE_DISCOVERY_DONE                      (0x04u)

/* Cy_BLE_NextCharDscrDiscovery parameters */
#define CY_BLE_DISCOVERY_INIT                      (0x00u)
#define CY_BLE_DISCOVERY_CONTINUE                  (0x01u)

#define CY_BLE_SFLASH_DIE_X_MASK                   (0x3Fu)
#define CY_BLE_SFLASH_DIE_X_BITS                   (6u)
#define CY_BLE_SFLASH_DIE_Y_MASK                   (0x3Fu)
#define CY_BLE_SFLASH_DIE_Y_BITS                   (6u)
#define CY_BLE_SFLASH_DIE_XY_BITS                  (CY_BLE_SFLASH_DIE_X_BITS + CY_BLE_SFLASH_DIE_Y_BITS)
#define CY_BLE_SFLASH_DIE_WAFER_MASK               (0x1Fu)
#define CY_BLE_SFLASH_DIE_WAFER_BITS               (5u)
#define CY_BLE_SFLASH_DIE_XYWAFER_BITS             (CY_BLE_SFLASH_DIE_XY_BITS + CY_BLE_SFLASH_DIE_WAFER_BITS)
#define CY_BLE_SFLASH_DIE_LOT_MASK                 (0x7Fu)
#define CY_BLE_SFLASH_DIE_LOT_BITS                 (7u)

/* Device address stored by user in ROW4 of the SFLASH */
#define CY_BLE_SFLASH_DEVICE_ADDRESS_PTR           ((cy_stc_ble_gap_bd_addr_t*)(SFLASH->BLE_DEVICE_ADDRESS))

#define CY_BLE_AD_STRUCTURE_MAX_LENGTH             (31u)

/* AD types for complete, shortened local name and device address */
#define CY_BLE_SHORT_LOCAL_NAME                    (0x08u)  /**< Shortened Local Name */
#define CY_BLE_COMPLETE_LOCAL_NAME                 (0x09u)  /**< Complete Local Name */
#define CY_BLE_ADV_DEVICE_ADDR                     (0x1Bu)  /**< LE Bluetooth Device Address */


#define CY_BLE_ADVERTISING_FAST                    (0x00u)
#define CY_BLE_ADVERTISING_SLOW                    (0x01u)
#define CY_BLE_ADVERTISING_CUSTOM                  (0x02u)

#define CY_BLE_SCANNING_FAST                       (0x00u)
#define CY_BLE_SCANNING_SLOW                       (0x01u)
#define CY_BLE_SCANNING_CUSTOM                     (0x02u)

