ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.h
#define CY_BLE_PENDING_STACK_FLASH_WRITE_BIT       (0x01u)
#define CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT        (0x02u)
#define CY_BLE_PENDING_CCCD_FLASH_CLEAR_BIT        (0x04u)
#define CY_BLE_PENDING_CCCD_FLASH_CLEAR_ALL_BIT    (0x08u)
#define CY_BLE_PENDING_CCCD_FLASH_CLEAR_MASK \
    (CY_BLE_PENDING_CCCD_FLASH_CLEAR_BIT | CY_BLE_PENDING_CCCD_FLASH_CLEAR_ALL_BIT)

    
/**
 * \addtogroup group_ble_common_api_macros
 * @{
 */
 
/* GAP Advertisement Flags */
#define CY_BLE_GAP_ADV_FLAG_LE_LIMITED_DISC_MODE        (0x01u)     /**< LE Limited Discoverable Mode. */
#define CY_BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE        (0x02u)     /**< LE General Discoverable Mode. */
#define CY_BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED        (0x04u)     /**< BR/EDR not supported. */
#define CY_BLE_GAP_ADV_FLAG_LE_BR_EDR_CONTROLLER        (0x08u)     /**< Simultaneous LE and BR/EDR, Controller. */
#define CY_BLE_GAP_ADV_FLAG_LE_BR_EDR_HOST              (0x10u)     /**< Simultaneous LE and BR/EDR, Host. */
#define CY_BLE_GAP_ADV_FLAGS_PACKET_LENGTH              (0x02u)     /**< Length of flags in an advertisement packet */

/* GAP Advertising interval min and max */
#define CY_BLE_GAP_ADV_ADVERT_INTERVAL_MIN              (0x0020u)   /**< Minimum Advertising interval in 625 us units,
                                                                     *   i.e. 20 ms. */
#define CY_BLE_GAP_ADV_ADVERT_INTERVAL_NONCON_MIN       (0x00A0u)   /**< Minimum Advertising interval in 625 us units
                                                                     *   for non connectable mode, i.e. 100 ms. */
#define CY_BLE_GAP_ADV_ADVERT_INTERVAL_MAX              (0x4000u)   /**< Maximum Advertising interval in 625 us units,
                                                                     *   i.e. 10.24 s. */
#define CY_BLE_GAP_ADV_ADVERT_INTERVAL_PACKET_LENGTH    (0x03u)     /**< Length of the Advertising Interval AD type in 
                                                                     *   an advertisement packet */
#define CY_BLE_GAPC_CONNECTING_TIMEOUT                  (30u)       /**< Seconds */
#define CY_BLE_INVALID_CONN_HANDLE_VALUE                (0xFFu)     /**< Invalid Connection Handle Value */

/* Write mode for Cy_BLE_StoreAppData */
#define CY_BLE_STORE_DATA_MODE_BLOCKING                 (0x0u)      /**< Blocking write */
#define CY_BLE_STORE_DATA_MODE_NON_BLOCKING             (0x1u)      /**< Non-blocking write */

/** @} group_ble_common_api_macros */

/***************************************
* Private Function Prototypes
***************************************/
void Cy_BLE_ServiceInit(void);
uint32_t Cy_BLE_GetDiscoveryIdx(cy_stc_ble_conn_handle_t connHandle);


/***************************************
* Function Prototypes
***************************************/
/**
 * \addtogroup group_ble_common_api_functions
 * @{
 */

cy_en_ble_api_result_t Cy_BLE_StoreAppData(const cy_stc_ble_app_flash_param_t *param);

 
#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
cy_en_ble_api_result_t Cy_BLE_StoreBondingData(void);
cy_en_ble_api_result_t Cy_BLE_GAP_RemoveBondedDevice(cy_stc_ble_gap_bd_addr_t* bdAddr);
#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

/** @} group_ble_common_api_functions */


/**
 * \addtogroup group_ble_common_api_gap_peripheral_functions
 * @{
 */
 
#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
cy_en_ble_api_result_t Cy_BLE_GAPP_StartAdvertisement(uint8_t advertisingIntervalType, uint8_t advertisingParamIndex);
cy_en_ble_api_result_t Cy_BLE_GAPP_StopAdvertisement(void);

/** \cond IGNORE */
void Cy_BLE_ChangeAdDeviceAddress(const cy_stc_ble_gap_bd_addr_t* bdAddr, uint8_t dest);
/** \endcond */

#endif /* CY_BLE_GAP_ROLE_PERIPHERAL */

/** @} group_ble_common_api_gap_peripheral_functions */

/**
 * \addtogroup group_ble_common_api_gap_central_functions
 * @{
 */
 
#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
cy_en_ble_api_result_t Cy_BLE_GAPC_StartScan(uint8_t scanningIntervalType, uint8_t scanParamIndex);
cy_en_ble_api_result_t Cy_BLE_GAPC_StopScan(void);
#endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

#if (CY_BLE_GAP_ROLE_CENTRAL)
cy_en_ble_api_result_t Cy_BLE_GAPC_ConnectDevice(const cy_stc_ble_gap_bd_addr_t * address, uint8_t centralParamIndex);
cy_en_ble_api_result_t Cy_BLE_GAPC_CancelDeviceConnection(void);
#endif /* CY_BLE_GAP_ROLE_CENTRAL */

/** @} group_ble_common_api_gap_central_functions */


/***************************************
* External data references
***************************************/
extern volatile uint8_t cy_ble_eventHandlerFlag;
extern cy_stc_ble_gap_bd_addr_t *cy_ble_sflashDeviceAddress;
extern cy_stc_ble_gap_bd_addr_t cy_ble_deviceAddress;
extern cy_en_ble_state_t cy_ble_state;

#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL))
extern cy_stc_ble_gap_auth_info_t cy_ble_authInfo[CY_BLE_CONFIG_AUTH_INFO_COUNT];
#endif /* ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)) */

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
extern cy_en_ble_adv_state_t cy_ble_advState;
extern uint8_t cy_ble_advIndex;
#endif  /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
extern cy_en_ble_scan_state_t cy_ble_scanState;
extern uint8_t cy_ble_scanIndex;
#endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER) */

#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL))
extern cy_stc_ble_conn_handle_t cy_ble_connHandle[CY_BLE_CONN_COUNT];
extern cy_en_ble_conn_state_t cy_ble_connState[CY_BLE_CONN_COUNT];
#endif /* ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
extern cy_stc_ble_gapc_disc_info_t cy_ble_discoveryInfo[CY_BLE_GAPC_CONF_COUNT];
#endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

#if (CY_BLE_GAP_ROLE_CENTRAL)
extern cy_stc_ble_gapc_conn_info_t cy_ble_connectionParameters;
extern cy_stc_ble_timer_info_t cy_ble_connectingTimeout;
#endif /* CY_BLE_GAP_ROLE_CENTRAL */

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
extern cy_stc_ble_gapp_disc_mode_info_t cy_ble_discoveryModeInfo[CY_BLE_GAPP_CONF_COUNT];
extern cy_stc_ble_gapp_disc_param_t cy_ble_discoveryParam[CY_BLE_GAPP_CONF_COUNT];
extern cy_stc_ble_gapp_disc_data_t cy_ble_discoveryData[CY_BLE_GAPP_CONF_COUNT];
extern cy_stc_ble_gapp_scan_rsp_data_t cy_ble_scanRspData[CY_BLE_GAPP_CONF_COUNT];
#endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */



