ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.h
#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))

/** This is a two-bit variable that contains status of pending write to flash operation.
 * This variable is initialized to zero in Cy_BLE_Init().
 * CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT flag is set after write to CCCD event when a
 * peer device supports bonding (cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING).
 * CY_BLE_PENDING_STACK_FLASH_WRITE_BIT flag is set after CY_BLE_EVT_PENDING_FLASH_WRITE event.
 * Cy_BLE_StoreBondingData() should be called to store pending bonding data.
 * This function automatically clears pending bits after write operation is complete.
 */
extern uint8_t cy_ble_pendingFlashWrite;

/** Bonding type setting of peer device, CY_BLE_GAP_BONDING_NONE or CY_BLE_GAP_BONDING.
 * It is initialized after pairing with peer device and used for cy_ble_pendingFlashWrite variable
 * setting.
 */
extern uint8_t cy_ble_peerBonding[CY_BLE_CONN_COUNT];


#endif  /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */


/***************************************
* Exported Functions (MACROS)
***************************************/
#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL))

/**
 * \addtogroup group_ble_common_api_functions
 * @{
*/
    
/******************************************************************************
* Function Name: Cy_BLE_GetConnHandleIdx
***************************************************************************//**
*  This function returns the index of connHandle in cy_ble_connHandle which correspond to
*  input parameter
*
*  \param connHandle: The connection handle.
*
*  \return
*   retValue - the index of connHandle
*
******************************************************************************/
__STATIC_INLINE uint8_t Cy_BLE_GetConnHandleIdx(cy_stc_ble_conn_handle_t connHandle)
{
    uint8_t idx;
    uint8_t retValue = CY_BLE_CONN_COUNT;

    for(idx = 0u; idx < CY_BLE_CONN_COUNT; idx++)
    {
        if(cy_ble_connHandle[idx].bdHandle == connHandle.bdHandle)
        {
            retValue = idx;
            break;
        }
    }
    if(retValue == CY_BLE_CONN_COUNT)
    {
        /* HALT in debug mode */
        CY_ASSERT(retValue != CY_BLE_CONN_COUNT);
        retValue = 0u;
    }

    return(retValue);
}
#endif  /* ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)) */

/******************************************************************************
* Function Name: Cy_BLE_GetState
***************************************************************************//**
*  This function is used to determine the current state of the component
*  state machine.
*
*  The component is in the state CY_BLE_STATE_INITIALIZING after the Cy_BLE_Start()
*  is called and until the CY_BLE_EVT_STACK_ON event is not received. After
*  successful initialization the state is changed to CY_BLE_STATE_ON.
*
*  For GAP Central role when the Cy_BLE_GAPC_ConnectDevice() is called, the state
*  is changed to CY_BLE_STATE_CONNECTING. After successful connection indicated
*  by CY_BLE_EVT_GAP_DEVICE_CONNECTED or CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE
*  event or the timeout indicated by CY_BLE_EVT_TIMEOUT event, the state is
*  changed to CY_BLE_STATE_ON.
*
* \return
*   * CY_BLE_STATE_STOPPED       - BLE is turned off
*   * CY_BLE_STATE_INITIALIZING, - Initializing state
*   * CY_BLE_STATE_ON            - BLE is turned on
*   * CY_BLE_STATE_CONNECTING    - Connecting
*
******************************************************************************/
#define Cy_BLE_GetState()    (cy_ble_state)


/******************************************************************************
* Function Name: Cy_BLE_SetState
***************************************************************************//**
*
*  Used to set the component state machine's state.
*
*  \param state: The desired state to which the event handler's
*   state machine should be set. The parameter state is a variable
*   of type cy_en_ble_state_t.
*
* \return
*  None
*
******************************************************************************/
#define Cy_BLE_SetState(state)    (cy_ble_state = (state))

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)


/******************************************************************************
* Function Name: Cy_BLE_GetAdvertisementState
***************************************************************************//**
*  This function returns the state of the link layer hardware advertisement
*  engine.
*
*  When Cy_BLE_GAPP_StartAdvertisement() is called, the state is set to
*  CY_BLE_ADV_STATE_ADV_INITIATED. It automatically changes to
*  CY_BLE_ADV_STATE_ADVERTISING when CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP
*  event is received. When Cy_BLE_GAPP_StopAdvertisement() is called, the
*  state is set to CY_BLE_ADV_STATE_STOP_INITIATED. It automatically changes
*  to CY_BLE_ADV_STATE_STOPPED when the CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP
*  event is received.
*
*  \return
*  cy_en_ble_adv_state_t - The current advertising state.
*
******************************************************************************/
__STATIC_INLINE cy_en_ble_adv_state_t Cy_BLE_GetAdvertisementState(void)
{
    return(cy_ble_advState);
}

/******************************************************************************
* Function Name: Cy_BLE_SetAdvertisementState
***************************************************************************//**
*
*  Used to set the state of the link layer hardware advertisement engine.
*
*  \param state: The desired state.
*
* \return
*  None
*
******************************************************************************/
__STATIC_INLINE void Cy_BLE_SetAdvertisementState(cy_en_ble_adv_state_t state)
{
    cy_ble_advState = state;
}

#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)

/******************************************************************************
* Function Name: Cy_BLE_GetScanState
***************************************************************************//**
*  This returns the state of the link layer hardware scan engine.
*
*  When Cy_BLE_GAPC_StartScan() is called the state is set to
*  CY_BLE_SCAN_STATE_SCAN_INITIATED. It automatically changes to
*  CY_BLE_ SCAN _STATE_SCANNING when the CY_BLE_EVT_GAPC_SCAN_START_STOP event is
*  received. When Cy_BLE_GAPC_StopScan() is called, the state is set to
*  CY_BLE_SCAN_STATE_STOP_INITIATED. It automatically changes to
*  CY_BLE_SCAN_STATE_STOPPED when the CY_BLE_EVT_GAPC_SCAN_START_STOP event is
*  received.
*
*  \return
*  cy_en_ble_scan_state_t - The current scan state.
*
******************************************************************************/
__STATIC_INLINE cy_en_ble_scan_state_t Cy_BLE_GetScanState(void)
{
    return(cy_ble_scanState);
}


