ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.h
/******************************************************************************
* Function Name: Cy_BLE_SetScanState
***************************************************************************//**
*
*  Used to set the state of the link layer hardware scan engine.
*
*  \param state: The desired state.
*
* \return
*  None
*
******************************************************************************/
__STATIC_INLINE void Cy_BLE_SetScanState(cy_en_ble_scan_state_t state)
{
    cy_ble_scanState = state;
}

#endif  /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER) */

 
#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL))

/******************************************************************************
* Function Name: Cy_BLE_GetConnectionState
***************************************************************************//**
*  This function returns the state of the BLE link for the specified connection
*  handle.
*
*  The state is set to CY_BLE_CONN_CONNECTED when CY_BLE_EVT_GATT_CONNECT_IND
*  event is received with the corresponding connection handle.
*  The state is set to CY_BLE_CONN_DISCONNECTED when the
*  CY_BLE_EVT_GATT_DISCONNECT_IND event is received.
*
*  For GATT Client role when Cy_BLE_GATTC_StartDiscovery() is called, the state
*  indicates the current flow of the discovery procedure by
*  CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING,
*  CY_BLE_CONN_STATE_CLIENT_INCL_DISCOVERING,
*  CY_BLE_CONN_STATE_CLIENT_CHAR_DISCOVERING,
*  CY_BLE_CONN_STATE_CLIENT_DESCR_DISCOVERING and changes to
*  CY_BLE_CONN_STATE_CLIENT_DISCOVERED when the procedure successfully completes.
*
*  The state changes from CY_BLE_CONN_STATE_CLIENT_DISCOVERED to
*  CY_BLE_CONN_STATE_CLIENT_DISCONNECTED_DISCOVERED when
*  the CY_BLE_EVT_GATT_DISCONNECT_IND event is received.
*  The state comes backs to CY_BLE_CONN_STATE_CLIENT_DISCOVERED when
*  CY_BLE_EVT_GATT_CONNECT_IND event is received and resolvable device
*  address is not changed.
*
*  \param connHandle: The connection handle.
*
*  \return
*  cy_en_ble_conn_state_t - The current client state.
*
******************************************************************************/
__STATIC_INLINE cy_en_ble_conn_state_t Cy_BLE_GetConnectionState(cy_stc_ble_conn_handle_t connHandle)
{
    return((connHandle.attId < CY_BLE_CONN_COUNT) ? cy_ble_connState[connHandle.attId] : CY_BLE_CONN_STATE_DISCONNECTED);
}


/******************************************************************************
* Function Name: Cy_BLE_SetConnectionState
***************************************************************************//**
*
*  Used to set BLE link state for the specified connection handle.
*
*  \param connHandle: Peer device handle
*  \param state:  The state that is desired to be set
*
******************************************************************************/
__STATIC_INLINE void Cy_BLE_SetConnectionState(cy_stc_ble_conn_handle_t connHandle,
                                               cy_en_ble_conn_state_t state)
{
    if(connHandle.attId < CY_BLE_CONN_COUNT)
    {
        cy_ble_connState[connHandle.attId] = state;
    }
    else
    {
        /* Halt in debug mode*/
        CY_ASSERT(connHandle.attId >= CY_BLE_CONN_COUNT);
    }
}

/******************************************************************************
* Function Name: Cy_BLE_GetNumOfActiveConn
***************************************************************************//**
*
*  Used to get active number of connections.
*
*  \return
*  connNum - number of active connections
*
******************************************************************************/
__STATIC_INLINE uint8_t Cy_BLE_GetNumOfActiveConn(void)
{
    uint32_t i;
    uint8_t connNum = 0u;

    for(i = 0u; i < CY_BLE_CONN_COUNT; i++)
    {
        if(cy_ble_connState[i] >= CY_BLE_CONN_STATE_CONNECTED)
        {
            connNum++;
        }
    }

    return(connNum);
}

/******************************************************************************
* Function Name: Cy_BLE_GetConnHandleByBdHandle
***************************************************************************//**
*
*  Used to get connection handle by bdHandle
*  This function halts in debug mode if bdHandle does not exist in the connected device
*  list
*
*  \param bdHandle: Peer device handle
*
*  \return
*   connHandle: Full connection handle.
*   connHandle.attId = CY_BLE_INVALID_CONN_HANDLE_VALUE: invalid bdHandle
*
******************************************************************************/
__STATIC_INLINE cy_stc_ble_conn_handle_t Cy_BLE_GetConnHandleByBdHandle(uint8_t bdHandle)
{
    uint32_t i;
    cy_stc_ble_conn_handle_t cHandle =
    {
        .attId    = CY_BLE_INVALID_CONN_HANDLE_VALUE,
        .bdHandle = CY_BLE_INVALID_CONN_HANDLE_VALUE
    };

    for(i = 0u; i < CY_BLE_CONN_COUNT; i++)
    {
        if((Cy_BLE_GetConnectionState(cy_ble_connHandle[i]) >= CY_BLE_CONN_STATE_CONNECTED) &&
                (cy_ble_connHandle[i].bdHandle == bdHandle))
        {
            cHandle = cy_ble_connHandle[i];
            break;
        }
    }
    if(cHandle.attId == CY_BLE_INVALID_CONN_HANDLE_VALUE)
    {
        /* HALT in debug mode */
        CY_ASSERT(cHandle.attId != CY_BLE_INVALID_CONN_HANDLE_VALUE);
    }

    return cHandle;
}

#endif /* ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)) */
/** @} group_ble_common_api_functions */

#endif /* CY_BLE_MODE_PROFILE */

#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* CY_BLE_GAP_H */

/* [] END OF FILE */
